huaweiwx/ARDUINO_Nuvoton/hardware/arm/Nuvoton/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms
# huaweiwx@sina.com 2018.10.12

menu.cpu=Processor
menu.clock_source=Clock source
menu.osc_speed=OSC Speed(MHz)
menu.cpu_speed=CPU Speed(MHz)
menu.serial=Serial communication
menu.upload_method=Upload method
menu.log=Debug Log_level

#################################################################
#                       nuvoton m480                            #
#################################################################
M480.name=M481/2/3/4

M480.build.core=nuvoton
M480.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
M480.build.f_cpu=192000000L
M480.build.variant=M480
M480.build.board=M480

M480.menu.cpu.m481_64I=GENERIC_M481SI(LQP64)(512kFLASH 160kRAM)
M480.menu.cpu.m481_64I.build.extra_flags=-DCHIP64P -DM481S
M480.menu.cpu.m481_64I.build.series=M480
M480.menu.cpu.m481_64I.build.variant=M480
M480.menu.cpu.m481_64I.build.board=GENERIC_M481S
M480.menu.cpu.m481_64I.build.ldscript=512K_160K_flash_S.ld
M480.menu.cpu.m481_64I.upload.maximum_size=524288
M480.menu.cpu.m481_64I.upload.maximum_data_size=163840

M480.menu.cpu.m481_64G=GENERIC_M481SG(LQP64)(256kFLASH 96kRAM)
M480.menu.cpu.m481_64G.build.extra_flags=-DCHIP64P -DM481S
M480.menu.cpu.m481_64G.build.series=M480
M480.menu.cpu.m481_64G.build.variant=M480
M480.menu.cpu.m481_64G.build.board=GENERIC_M481S
M480.menu.cpu.m481_64G.build.ldscript=256K_96K_flash_S.ld
M480.menu.cpu.m481_64G.upload.maximum_size=262144
M480.menu.cpu.m481_64G.upload.maximum_data_size=98304

M480.menu.cpu.m481_48I=GENERIC_M481LI(LQP48)(512kFLASH 160kRAM)
M480.menu.cpu.m481_48I.build.extra_flags=-DCHIP48P -DM481L
M480.menu.cpu.m481_48I.build.series=M480
M480.menu.cpu.m481_48I.build.variant=M480
M480.menu.cpu.m481_48I.build.board=GENERIC_M481L
M480.menu.cpu.m481_48I.build.ldscript=512K_160K_flash_S.ld
M480.menu.cpu.m481_48I.upload.maximum_size=524288
M480.menu.cpu.m481_48I.upload.maximum_data_size=163840

M480.menu.cpu.m481_48G=GENERIC_M481LG(LQP48)(256kFLASH 96kRAM)
M480.menu.cpu.m481_48G.build.extra_flags=-DCHIP48P -DM481L
M480.menu.cpu.m481_48G.build.series=M480
M480.menu.cpu.m481_48G.build.variant=M480
M480.menu.cpu.m481_48G.build.board=GENERIC_M481L
M480.menu.cpu.m481_48G.build.ldscript=256K_96K_flash_S.ld
M480.menu.cpu.m481_48G.upload.maximum_size=262144
M480.menu.cpu.m481_48G.upload.maximum_data_size=98304

M480.menu.cpu.m481_33I=GENERIC_M481ZI(QFN33)(512kFLASH 160kRAM)
M480.menu.cpu.m481_33I.build.extra_flags=-DCHIP33P -DM481Z
M480.menu.cpu.m481_33I.build.series=M480
M480.menu.cpu.m481_33I.build.variant=M480
M480.menu.cpu.m481_33I.build.board=GENERIC_M481Z
M480.menu.cpu.m481_33I.build.ldscript=512K_160K_flash_S.ld
M480.menu.cpu.m481_33I.upload.maximum_size=524288
M480.menu.cpu.m481_33I.upload.maximum_data_size=163840

M480.menu.cpu.m481_33G=GENERIC_M481ZG(QFN33)(256kFLASH 96kRAM)
M480.menu.cpu.m481_33G.build.extra_flags=-DCHIP33P -DM481Z
M480.menu.cpu.m481_33G.build.series=M480
M480.menu.cpu.m481_33G.build.variant=M480
M480.menu.cpu.m481_33G.build.board=GENERIC_M481Z
M480.menu.cpu.m481_33G.build.ldscript=256K_96K_flash_S.ld
M480.menu.cpu.m481_33G.upload.maximum_size=262144
M480.menu.cpu.m481_33G.upload.maximum_data_size=98304

M480.menu.cpu.m482_128I=GENERIC_M482KI(LQP128)(512kFLASH 160kRAM)
M480.menu.cpu.m482_128I.build.extra_flags=-DCHIP128P -DM482K
M480.menu.cpu.m482_128I.build.series=M480
M480.menu.cpu.m482_128I.build.variant=M480
M480.menu.cpu.m482_128I.build.board=GENERIC_M482K
M480.menu.cpu.m482_128I.build.ldscript=512K_160K_flash_S.ld
M480.menu.cpu.m482_128I.upload.maximum_size=524288
M480.menu.cpu.m482_128I.upload.maximum_data_size=163840

M480.menu.cpu.m482_128G=GENERIC_M482KG(LQP128)(256kFLASH 96kRAM)
M480.menu.cpu.m482_128G.build.extra_flags=-DCHIP128P -DM482K
M480.menu.cpu.m482_128G.build.series=M480
M480.menu.cpu.m482_128G.build.variant=M480
M480.menu.cpu.m482_128G.build.board=GENERIC_M482K
M480.menu.cpu.m482_128G.build.ldscript=256K_96K_flash_S.ld
M480.menu.cpu.m482_128G.upload.maximum_size=262144
M480.menu.cpu.m482_128G.upload.maximum_data_size=98304

M480.menu.cpu.m482_64I=GENERIC_M482SI(LQP64)(512kFLASH 160kRAM)
M480.menu.cpu.m482_64I.build.extra_flags=-DCHIP64P -DM482S
M480.menu.cpu.m482_64I.build.series=M480
M480.menu.cpu.m482_64I.build.variant=M480
M480.menu.cpu.m482_64I.build.board=GENERIC_M482S
M480.menu.cpu.m482_64I.build.ldscript=512K_160K_flash_S.ld
M480.menu.cpu.m482_64I.upload.maximum_size=524288
M480.menu.cpu.m482_64I.upload.maximum_data_size=163840

M480.menu.cpu.m482_64G=GENERIC_M482SG(LQP64)(256kFLASH 96kRAM)
M480.menu.cpu.m482_64G.build.extra_flags=-DCHIP64P -DM482S
M480.menu.cpu.m482_64G.build.series=M480
M480.menu.cpu.m482_64G.build.variant=M480
M480.menu.cpu.m482_64G.build.board=GENERIC_M482S
M480.menu.cpu.m482_64G.build.ldscript=256K_96K_flash_S.ld
M480.menu.cpu.m482_64G.upload.maximum_size=262144
M480.menu.cpu.m482_64G.upload.maximum_data_size=98304

M480.menu.cpu.m482_48I=GENERIC_M482LI(LQP48)(512kFLASH 160kRAM)
M480.menu.cpu.m482_48I.build.extra_flags=-DCHIP48P -DM482L
M480.menu.cpu.m482_48I.build.series=M480
M480.menu.cpu.m482_48I.build.variant=M480
M480.menu.cpu.m482_48I.build.board=GENERIC_M482L
M480.menu.cpu.m482_48I.build.ldscript=512K_160K_flash_S.ld
M480.menu.cpu.m482_48I.upload.maximum_size=524288
M480.menu.cpu.m482_48I.upload.maximum_data_size=163840

M480.menu.cpu.m482_48G=GENERIC_M482LG(LQP48)(256kFLASH 96kRAM)
M480.menu.cpu.m482_48G.build.extra_flags=-DCHIP48P -DM482L
M480.menu.cpu.m482_48G.build.series=M480
M480.menu.cpu.m482_48G.build.variant=M480
M480.menu.cpu.m482_48G.build.board=GENERIC_M482L
M480.menu.cpu.m482_48G.build.ldscript=256K_96K_flash_S.ld
M480.menu.cpu.m482_48G.upload.maximum_size=262144
M480.menu.cpu.m482_48G.upload.maximum_data_size=98304

M480.menu.cpu.m482_33I=GENERIC_M482ZI(QFN33)(512kFLASH 160kRAM)
M480.menu.cpu.m482_33I.build.extra_flags=-DCHIP33P -DM482Z
M480.menu.cpu.m482_33I.build.series=M480
M480.menu.cpu.m482_33I.build.variant=M480
M480.menu.cpu.m482_33I.build.board=GENERIC_M482Z
M480.menu.cpu.m482_33I.build.ldscript=512K_160K_flash_S.ld
M480.menu.cpu.m482_33I.upload.maximum_size=524288
M480.menu.cpu.m482_33I.upload.maximum_data_size=163840

M480.menu.cpu.m483_128=GENERIC_M483K(LQP128)(512kFLASH 160kRAM)
M480.menu.cpu.m483_128.build.extra_flags=-DCHIP128P -DM483K
M480.menu.cpu.m483_128.build.series=M480
M480.menu.cpu.m483_128.build.variant=M480
M480.menu.cpu.m483_128.build.board=GENERIC_M483K
M480.menu.cpu.m483_128.build.ldscript=512K_160K_flash_S.ld
M480.menu.cpu.m483_128.upload.maximum_size=524288
M480.menu.cpu.m483_128.upload.maximum_data_size=163840

M480.menu.cpu.m483_64I=GENERIC_M483SI(LQP64)(512kFLASH 160kRAM)
M480.menu.cpu.m483_64I.build.extra_flags=-DCHIP64P -DM483S
M480.menu.cpu.m483_64I.build.series=M480
M480.menu.cpu.m483_64I.build.variant=M480
M480.menu.cpu.m483_64I.build.board=GENERIC_M483S
M480.menu.cpu.m483_64I.build.ldscript=512K_160K_flash_S.ld
M480.menu.cpu.m483_64I.upload.maximum_size=524288
M480.menu.cpu.m483_64I.upload.maximum_data_size=163840

M480.menu.cpu.m483_64G=GENERIC_M483SG(LQP64)(256kFLASH 96kRAM)
M480.menu.cpu.m483_64G.build.extra_flags=-DCHIP64P -DM483S
M480.menu.cpu.m483_64G.build.series=M480
M480.menu.cpu.m483_64G.build.variant=M480
M480.menu.cpu.m483_64G.build.board=GENERIC_M483S
M480.menu.cpu.m483_64G.build.ldscript=256K_96K_flash_S.ld
M480.menu.cpu.m483_64G.upload.maximum_size=262144
M480.menu.cpu.m483_64G.upload.maximum_data_size=98304

M480.menu.cpu.m484_128=GENERIC_M484K(LQP128)(512kFLASH 160kRAM)
M480.menu.cpu.m484_128.build.extra_flags=-DCHIP128P -DM484K
M480.menu.cpu.m484_128.build.series=M480
M480.menu.cpu.m484_128.build.variant=M480
M480.menu.cpu.m484_128.build.board=GENERIC_M484K
M480.menu.cpu.m484_128.build.ldscript=512K_160K_flash_S.ld
M480.menu.cpu.m484_128.upload.maximum_size=524288
M480.menu.cpu.m484_128.upload.maximum_data_size=163840

M480.menu.cpu.m484_64I=GENERIC_M484SI(LQP64)(512kFLASH 160kRAM)
M480.menu.cpu.m484_64I.build.extra_flags=-DCHIP64P -DM484S
M480.menu.cpu.m484_64I.build.series=M480
M480.menu.cpu.m484_64I.build.variant=M480
M480.menu.cpu.m484_64I.build.board=GENERIC_M484S
M480.menu.cpu.m484_64I.build.ldscript=512K_160K_flash_S.ld
M480.menu.cpu.m484_64I.upload.maximum_size=524288
M480.menu.cpu.m484_64I.upload.maximum_data_size=163840

