huaweiwx/ARDUINO_Nuvoton/hardware/arm/Nuvoton/boards.txt
M480.menu.cpu.m484_64G=GENERIC_M484SG(LQP64)(256kFLASH 96kRAM)
M480.menu.cpu.m484_64G.build.extra_flags=-DCHIP64P -DM484S
M480.menu.cpu.m484_64G.build.series=M480
M480.menu.cpu.m484_64G.build.variant=M480
M480.menu.cpu.m484_64G.build.board=GENERIC_M484S
M480.menu.cpu.m484_64G.build.ldscript=256K_96K_flash_S.ld
M480.menu.cpu.m484_64G.upload.maximum_size=262144
M480.menu.cpu.m484_64G.upload.maximum_data_size=98304

M480.menu.clock_source.HIRC192=HIRC(192MHz)
M480.menu.clock_source.HIRC192.build.f_cpu=192000000L -DHIRC
M480.menu.clock_source.HXT192=HXT_12M(192MMHz)
M480.menu.clock_source.HXT192.build.f_cpu=192000000L -DHXT12

M480.menu.serial.UART0=Serial0(PF_2/3)
M480.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
M480.menu.serial.UART1=Serial1(PB_2/3)
M480.menu.serial.UART1.build.extra_flags_serial=-DMENU_SERIAL=Serial1
M480.menu.serial.UART2=Serial2(PB_0/1)
M480.menu.serial.UART2.build.extra_flags_serial=-DMENU_SERIAL=Serial2
M480.menu.serial.UART3=Serial3(PB_14/15)
M480.menu.serial.UART3.build.extra_flags_serial=-DMENU_SERIAL=Serial3
M480.menu.serial.UART4=Serial4(PA_2/3))
M480.menu.serial.UART4.build.extra_flags_serial=-DMENU_SERIAL=Serial4
M480.menu.serial.UART5=Serial5(PB_4/5)
M480.menu.serial.UART5.build.extra_flags_serial=-DMENU_SERIAL=Serial5
M480.menu.serial.NuICE=Nulink console
M480.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole
M480.menu.serial.NuICE.upload.console=NUCONSOLE

#------------------------ DEBUG & LOGLEVEL ----------------------------#
M480.menu.log.default=Release(no-exceptions)
M480.menu.log.default.build.log_level=-fno-exceptions
M480.menu.log.Release=Release(exceptions)
M480.menu.log.fatal=FATAL
M480.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_ASSERT
M480.menu.log.error=ERROR
M480.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_ASSERT
M480.menu.log.warning=WARNING
M480.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_ASSERT
M480.menu.log.info=INFO
M480.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_ASSERT
M480.menu.log.debug=DEBUG
M480.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_ASSERT
M480.menu.log.trace=TRACE
M480.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_ASSERT

M480.upload.tool=nulinkburn
M480.upload.protocol=nuc-ba
M480.upload.use_1200bps_touch=false
M480.upload.wait_for_upload_port=false
M480.upload.native_usb=false

################################################################################################
#                                   Nuvoton-M451                                               #
################################################################################################
M451.name=M451/2/3
M451.build.vid=0x2341
M451.build.pid=0x003e

M451.build.core=nuvoton
M451.build.mcu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard
M451.build.f_cpu=72000000L
M451.build.series=M451Series
M451.build.variant=M451
M451.build.board=NuTiny_M451
M451.build.extra_flags0=-D__M451__ -DUSB_PID={build.pid} -DUSB_VID={build.vid} -DUSBCON

M451.menu.cpu.m451vg=GENERIC_M451VG6AE(LQP100)(256kFLASH 32kRAM)
M451.menu.cpu.m451vg.build.extra_flags={build.extra_flags0} -DCHIP100P -DM451VG
M451.menu.cpu.m451vg.build.ldscript=256K_32K_flash.ld
M451.menu.cpu.m451vg.upload.maximum_size=262144
M451.menu.cpu.m451vg.upload.maximum_data_size=32768

M451.menu.cpu.m451ve=GENERIC_M451VE6AE(LQP100)(128kFLASH 32kRAM)
M451.menu.cpu.m451ve.build.extra_flags={build.extra_flags0} -DCHIP100P -DM451VE
M451.menu.cpu.m451ve.build.ldscript=128K_32K_flash.ld
M451.menu.cpu.m451ve.upload.maximum_size=131072
M451.menu.cpu.m451ve.upload.maximum_data_size=32768

M451.menu.cpu.m451rg=GENERIC_M451RG6AE(LQP64)(256kFLASH 32kRAM)
M451.menu.cpu.m451rg.build.extra_flags={build.extra_flags0} -DCHIP64P -DM451RG
M451.menu.cpu.m451rg.build.ldscript=256K_32K_flash.ld
M451.menu.cpu.m451rg.upload.maximum_size=262144
M451.menu.cpu.m451rg.upload.maximum_data_size=32768

M451.menu.cpu.m451re=GENERIC_M451RE6AE(LQP64)(128kFLASH 32kRAM)
M451.menu.cpu.m451re.build.extra_flags={build.extra_flags0} -DCHIP64P -DM451RE
M451.menu.cpu.m451re.build.ldscript=128K_32K_flash.ld
M451.menu.cpu.m451re.upload.maximum_size=131072
M451.menu.cpu.m451re.upload.maximum_data_size=32768

M451.menu.cpu.m451lg=GENERIC_M451LG6AE(LQP48)(256kFLASH 32kRAM)
M451.menu.cpu.m451lg.build.extra_flags={build.extra_flags0} -DCHIP48P -DM451LG
M451.menu.cpu.m451lg.build.ldscript=256K_32K_flash.ld
M451.menu.cpu.m451lg.upload.maximum_size=262144
M451.menu.cpu.m451lg.upload.maximum_data_size=32768

M451.menu.cpu.m451le=GENERIC_M451LE6AE(LQP48)(128kFLASH 32kRAM)
M451.menu.cpu.m451le.build.extra_flags={build.extra_flags0} -DCHIP48P -DM451LE
M451.menu.cpu.m451le.build.ldscript=128K_32K_flash.ld
M451.menu.cpu.m451le.upload.maximum_size=131072
M451.menu.cpu.m451le.upload.maximum_data_size=32768

M451.menu.cpu.m453vg=NuTiny_M453VG6AE(LQP100)(256kFLASH 32kRAM)
M451.menu.cpu.m453vg.build.extra_flags={build.extra_flags0} -DCHIP100P -DM453VG
M451.menu.cpu.m453vg.build.ldscript=256K_32K_flash.ld
M451.menu.cpu.m453vg.upload.maximum_size=262144
M451.menu.cpu.m453vg.upload.maximum_data_size=32768

M451.menu.cpu.m453ve=GENERIC_M453VE6AE(LQP100)(128kFLASH 32kRAM)
M451.menu.cpu.m453ve.build.extra_flags={build.extra_flags0} -DCHIP100P -DM453VE
M451.menu.cpu.m453ve.build.ldscript=128K_32K_flash.ld
M451.menu.cpu.m453ve.upload.maximum_size=131072
M451.menu.cpu.m453ve.upload.maximum_data_size=32768

M451.menu.cpu.m453rg=GENERIC_M453RG6AE(LQP64)(256kFLASH 32kRAM)
M451.menu.cpu.m453rg.build.extra_flags={build.extra_flags0} -DCHIP64P -DM453RG
M451.menu.cpu.m453rg.build.ldscript=256K_32K_flash.ld
M451.menu.cpu.m453rg.upload.maximum_size=262144
M451.menu.cpu.m453rg.upload.maximum_data_size=32768

M451.menu.cpu.m453re=GENERIC_M453RE6AE(LQP64)(128kFLASH 32kRAM)
M451.menu.cpu.m453re.build.extra_flags={build.extra_flags0} -DCHIP64P -DM453RE
M451.menu.cpu.m453re.build.ldscript=128K_32K_flash.ld
M451.menu.cpu.m453re.upload.maximum_size=131072
M451.menu.cpu.m453re.upload.maximum_data_size=32768

M451.menu.cpu.m453lg=GENERIC_M453LG6AE(LQP48)(256kFLASH 32kRAM)
M451.menu.cpu.m453lg.build.extra_flags={build.extra_flags0} -DCHIP48P -DM453LG
M451.menu.cpu.m453lg.build.ldscript=256K_32K_flash.ld
M451.menu.cpu.m453lg.upload.maximum_size=262144
M451.menu.cpu.m453lg.upload.maximum_data_size=32768

M451.menu.cpu.m453le=GENERIC_M453LE6AE(LQP48)(128kFLASH 32kRAM)
M451.menu.cpu.m453le.build.extra_flags={build.extra_flags0} -DCHIP48P -DM453LE
M451.menu.cpu.m453le.build.ldscript=128K_32K_flash.ld
M451.menu.cpu.m453le.upload.maximum_size=131072
M451.menu.cpu.m453le.upload.maximum_data_size=32768

M451.menu.serial.UART0=Serial0(PD_6/1)
M451.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
M451.menu.serial.UART1=Serial1(PB_2/3)
M451.menu.serial.UART1.build.extra_flags_serial=-DMENU_SERIAL=Serial1
M451.menu.serial.UART2=Serial2(PC_3/2)
M451.menu.serial.UART2.build.extra_flags_serial=-DMENU_SERIAL=Serial2
M451.menu.serial.UART3=Serial3(PA9_8)
M451.menu.serial.UART3.build.extra_flags_serial=-DMENU_SERIAL=Serial3
M451.menu.serial.NuICE=Nulink console
M451.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole
M451.menu.serial.NuICE.upload.console=NUCONSOLE

