huaweiwx/ARDUINO_Nuvoton/hardware/arm/Nuvoton/boards.txt
#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
M451.menu.log.default=Release(no-exceptions)
M451.menu.log.default.build.log_level=-fno-exceptions
M451.menu.log.Release=Release(exceptions)
M451.menu.log.fatal=FATAL
M451.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_ASSERT
M451.menu.log.error=ERROR
M451.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_ASSERT
M451.menu.log.warning=WARNING
M451.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_ASSERT
M451.menu.log.info=INFO
M451.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_ASSERT
M451.menu.log.debug=DEBUG
M451.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_ASSERT
M451.menu.log.trace=TRACE
M451.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_ASSERT

M451.upload.tool=nulinkburn
M451.upload.protocol=nuc-ba
M451.upload.use_1200bps_touch=false
M451.upload.wait_for_upload_port=false
M451.upload.native_usb=false

################################################################################################
#                                   Nuvoton-M240                                               #
################################################################################################
NUC200.name=NuEdu_NUC240(128kFLASH 16kRAM) 
NUC200.build.vid=0x2341
NUC200.build.pid=0x003e

NUC200.build.core=nuvoton
NUC200.build.mcu=cortex-m0
NUC200.build.f_cpu=48000000L

NUC200.build.series=NUC200Series
NUC200.build.variant=NUC240
NUC200.build.board=NuEdu_NUC240
NUC200.build.extra_flags=-D__NUC240__ -DCHIP100P -DUSB_PID={build.pid} -DUSB_VID={build.vid} -DUSBCON
NUC200.build.ldscript=128K_16K_flash.ld
NUC200.upload.maximum_size=131072
NUC200.upload.maximum_data_size=16384

NUC200.menu.serial.UART0=Serial0(PB_0/1)
NUC200.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
NUC200.menu.serial.UART1=Serial1(PB_4/5)
NUC200.menu.serial.UART1.build.extra_flags_serial=-DMENU_SERIAL=Serial1
NUC200.menu.serial.UART2=Serial2(PD_14/15)
NUC200.menu.serial.UART2.build.extra_flags_serial=-DMENU_SERIAL=Serial2
NUC200.menu.serial.NuICE=Nulink console
NUC200.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole
NUC200.menu.serial.NuICE.upload.console=NUCONSOLE

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
NUC200.menu.log.default=Release(no-exceptions)
NUC200.menu.log.default.build.log_level=-fno-exceptions
NUC200.menu.log.Release=Release(exceptions)
NUC200.menu.log.fatal=FATAL
NUC200.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_ASSERT
NUC200.menu.log.error=ERROR
NUC200.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_ASSERT
NUC200.menu.log.warning=WARNING
NUC200.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_ASSERT
NUC200.menu.log.info=INFO
NUC200.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_ASSERT
NUC200.menu.log.debug=DEBUG
NUC200.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_ASSERT
NUC200.menu.log.trace=TRACE
NUC200.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_ASSERT

NUC200.upload.tool=nulinkburn
NUC200.upload.protocol=sam-ba
NUC200.upload.use_1200bps_touch=false
NUC200.upload.wait_for_upload_port=false
NUC200.upload.native_usb=false

############################################### NuEdu-Uno ##########################################
NUC131.name=NuEdu-Uno(NUC131) 
NUC131.build.vid=0x2341
NUC131.build.pid=0x003e

NUC131.build.core=nuvoton
NUC131.build.mcu=cortex-m0
NUC131.build.f_cpu=50000000L

NUC131.build.series=NUC131
NUC131.build.board=NuEdu_NUC131
NUC131.build.variant=NUC131_UNO
NUC131.build.extra_flags=-D__NUC131__ -DUSB_PID={build.pid} -DUSB_VID={build.vid} -DUSBCON
NUC131.build.ldscript=64K_8K_flash.ld
NUC131.upload.maximum_size=65536
NUC131.upload.maximum_data_size=8192

NUC131.menu.serial.UART0=Serial0
NUC131.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
#NUC131.menu.serial.UART1=Serial1
#NUC131.menu.serial.UART1.build.extra_flags_serial=-DMENU_SERIAL=Serial1
NUC131.menu.serial.NuICE=Nulink console
NUC131.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole
NUC131.menu.serial.NuICE.upload.console=NUCONSOLE

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
NUC131.menu.log.default=Release(no-exceptions)
NUC131.menu.log.default.build.log_level=-fno-exceptions
NUC131.menu.log.Release=Release(exceptions)
NUC131.menu.log.fatal=FATAL
NUC131.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_ASSERT
NUC131.menu.log.error=ERROR
NUC131.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_ASSERT
NUC131.menu.log.warning=WARNING
NUC131.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_ASSERT
NUC131.menu.log.info=INFO
NUC131.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_ASSERT
NUC131.menu.log.debug=DEBUG
NUC131.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_ASSERT
NUC131.menu.log.trace=TRACE
NUC131.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_ASSERT

NUC131.upload.tool=nulinkburn
NUC131.upload.protocol=nuc-ba
NUC131.upload.use_1200bps_touch=false
NUC131.upload.wait_for_upload_port=false
NUC131.upload.native_usb=false

############################################### NuMaker_NANO100 ##########################################
NANO130.name=NANO130
NANO130.build.vid=0x2341
NANO130.build.pid=0x003e

NANO130.build.core=nuvoton
NANO130.build.mcu=cortex-m0
NANO130.build.f_cpu=42000000L
NANO130.build.variant=NANO130
NANO130.build.board=NuEdu_NANO130

NANO130.menu.cpu.NuEdu=NuEdu-EVB_NANO130(128kFLASH 16kRAM)

NANO130.menu.cpu.NuTiny=NuTiny_EVB_NANO130(128kFLASH 16kRAM)
NANO130.menu.cpu.NuTiny.build.board=NuTiny_NANO130

NANO130.build.series=Nano100Series
NANO130.build.extra_flags=-D__NANO100__ -DCHIP128P -DUSB_PID={build.pid} -DUSB_VID={build.vid} -DUSBCON
NANO130.build.ldscript=128K_16K_flash_S.ld
NANO130.upload.maximum_size=131072
NANO130.upload.maximum_data_size=16384

NANO130.menu.clock_source.HXT12=HXT
NANO130.menu.clock_source.HXT12.build.f_cpu=42000000L -DHXT12
NANO130.menu.clock_source.HIRC=HIRC
NANO130.menu.clock_source.HIRC.build.f_cpu=42000000L -DHIRC

NANO130.menu.serial.UART0=Serial0(PA_14/15)
NANO130.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
NANO130.menu.serial.UART1=Serial1(PB_4/5)
NANO130.menu.serial.UART1.build.extra_flags_serial=-DMENU_SERIAL=Serial1
NANO130.menu.serial.NuICE=Nulink console
NANO130.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole
NANO130.menu.serial.NuICE.upload.console=NUCONSOLE

