huaweiwx/ARDUINO_Nuvoton/hardware/arm/Nuvoton/boards.txt
M05x.menu.cpu.m058_33=GENERIC_M058Z(QFN33)  (32kFLASH 4kRAM)
M05x.menu.cpu.m058_33.build.extra_flags=-DCHIP33P -DM058Z
M05x.menu.cpu.m058_33.build.series=M058S
M05x.menu.cpu.m058_33.build.variant=M058S
M05x.menu.cpu.m058_33.build.board=GENERIC_M058Z
M05x.menu.cpu.m058_33.build.ldscript=32K_4K_flash.ld
M05x.menu.cpu.m058_33.upload.maximum_size=32768
M05x.menu.cpu.m058_33.upload.maximum_data_size=4096
M05x.menu.cpu.m058_33.upload.device=M058ZE

M05x.menu.cpu.m058_20=GENERIC_M058S(TSSOP20)(32kFLASH 4kRAM)
M05x.menu.cpu.m058_20.build.extra_flags=-DCHIP20P -DM058s
M05x.menu.cpu.m058_20.build.series=M058S
M05x.menu.cpu.m058_20.build.variant=M058S
M05x.menu.cpu.m058_20.build.board=GENERIC_M058S
M05x.menu.cpu.m058_20.build.ldscript=32K_4K_flash.ld
M05x.menu.cpu.m058_20.upload.maximum_size=32768
M05x.menu.cpu.m058_20.upload.maximum_data_size=4096
M05x.menu.cpu.m058_20.upload.device=M058SE

M05x.menu.cpu.m054_48=GENERIC_M054L(LQP48)  (16kFLASH 4kRAM)
M05x.menu.cpu.m054_48.build.extra_flags=-DCHIP48P -DM054L
M05x.menu.cpu.m054_48.build.series=M051Series
M05x.menu.cpu.m054_48.build.variant=M051
M05x.menu.cpu.m054_48.build.board=GENERIC_M054L
M05x.menu.cpu.m054_48.build.ldscript=16K_4K_flash.ld
M05x.menu.cpu.m054_48.upload.maximum_size=16384
M05x.menu.cpu.m054_48.upload.maximum_data_size=4096
M05x.menu.cpu.m054_48.upload.device=M054LE

M05x.menu.cpu.m054_33=GENERIC_M054Z(QFN33)  (16kFLASH 4kRAM)
M05x.menu.cpu.m054_33.build.extra_flags=-DCHIP33P -DM054Z
M05x.menu.cpu.m054_33.build.series=M051Series
M05x.menu.cpu.m054_33.build.variant=M051
M05x.menu.cpu.m054_33.build.board=GENERIC_M054Z
M05x.menu.cpu.m054_33.build.ldscript=16K_4K_flash.ld
M05x.menu.cpu.m054_33.upload.maximum_size=16384
M05x.menu.cpu.m054_33.upload.maximum_data_size=4096
M05x.menu.cpu.m054_33.upload.device=M054ZE

M05x.menu.cpu.m052_48=GENERIC_M052L(LQP48)   (8kFLASH 4kRAM)
M05x.menu.cpu.m052_48.build.extra_flags=-DCHIP48P -DM052L
M05x.menu.cpu.m052_48.build.series=M051Series
M05x.menu.cpu.m052_48.build.variant=M051
M05x.menu.cpu.m052_48.build.board=GENERIC_M052L
M05x.menu.cpu.m052_48.build.ldscript=8K_4K_flash.ld
M05x.menu.cpu.m052_48.upload.maximum_size=8192
M05x.menu.cpu.m052_48.upload.maximum_data_size=4096
M05x.menu.cpu.m052_48.upload.device=M052LE

M05x.menu.cpu.m052_33=GENERIC_M052Z(QFN33)   (8kFLASH 4kRAM)
M05x.menu.cpu.m052_33.build.extra_flags=-DCHIP33P -DM052Z
M05x.menu.cpu.m052_33.build.series=M051Series
M05x.menu.cpu.m052_33.build.variant=M051
M05x.menu.cpu.m052_33.build.board=GENERIC_M052Z
M05x.menu.cpu.m052_33.build.ldscript=8K_4K_flash.ld
M05x.menu.cpu.m052_33.upload.maximum_size=8192
M05x.menu.cpu.m052_33.upload.maximum_data_size=4096
M05x.menu.cpu.m052_33.upload.device=M052ZE

M05x.menu.clock_source.HIRC=HIRC_22M(22.1184MHz)
M05x.menu.clock_source.HIRC.build.f_cpu=22118400L -DHIRC
M05x.menu.clock_source.HXT1=HXT_12M(48MMHz)
M05x.menu.clock_source.HXT1.build.f_cpu=48000000L -DHXT12
M05x.menu.clock_source.HXT2=HXT_12M(24MMHz)
M05x.menu.clock_source.HXT2.build.f_cpu=24000000L -DHXT12

M05x.menu.serial.UART0=Serial0(P3_0/1)
M05x.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
M05x.menu.serial.UART1=Serial1(P0_3/2)
M05x.menu.serial.UART1.build.extra_flags_serial=-DMENU_SERIAL=Serial1
M05x.menu.serial.NuICE=Nulink console
M05x.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole
M05x.menu.serial.NuICE.upload.console=NUCONSOLE

#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
M05x.menu.log.default=Release(no-exceptions)
M05x.menu.log.default.build.log_level=-fno-exceptions
M05x.menu.log.Release=Release(exceptions)
M05x.menu.log.fatal=FATAL
M05x.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_ASSERT
M05x.menu.log.error=ERROR
M05x.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_ASSERT
M05x.menu.log.warning=WARNING
M05x.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_ASSERT
M05x.menu.log.info=INFO
M05x.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_ASSERT
M05x.menu.log.debug=DEBUG
M05x.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_ASSERT
M05x.menu.log.trace=TRACE
M05x.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_ASSERT

M05x.menu.upload_method.nulink=Nulink
M05x.menu.upload_method.nulink.upload.tool=nulinkburn
M05x.menu.upload_method.nulink.upload.protocol=nuc-ba
M05x.menu.upload_method.nulink.upload.use_1200bps_touch=false
M05x.menu.upload_method.nulink.upload.wait_for_upload_port=false
M05x.menu.upload_method.nulink.upload.native_usb=false

M05x.menu.upload_method.jLinkMethod=JLink
M05x.menu.upload_method.jLinkMethod.upload.tool=jlinkob_upload
M05x.menu.upload_method.jLinkMethod.upload.protocol=jlink

########################################################
#                  nuvoton mini58                      #
########################################################
MINI58.name=Mini58

MINI58.build.core=nuvoton
MINI58.build.mcu=cortex-m0
MINI58.build.f_cpu=22118400L
MINI58.build.variant=MINI58
MINI58.build.board=GENERIC_MINI58FDE

MINI58.menu.cpu.MINI58_48=GENERIC_MINI58L(LQP48)  (32kFLASH 4kRAM)
MINI58.menu.cpu.MINI58_48.build.extra_flags=-DCHIP48P -DMINI58L
MINI58.menu.cpu.MINI58_48.build.variant=MINI58
MINI58.menu.cpu.MINI58_48.build.board=GENERIC_MINI58L
MINI58.menu.cpu.MINI58_48.build.series=Mini58Series
MINI58.menu.cpu.MINI58_48.build.ldscript=32K_4K_flash.ld
MINI58.menu.cpu.MINI58_48.upload.maximum_size=32768
MINI58.menu.cpu.MINI58_48.upload.maximum_data_size=4096
MINI58.menu.cpu.MINI58_48.upload.device=MINI58LAN

MINI58.menu.cpu.MINI58_33=GENERIC_MINI58T/Z(QFN33)(32kFLASH 4kRAM)
MINI58.menu.cpu.MINI58_33.build.extra_flags=-DCHIP33P -DMINI58TZ
MINI58.menu.cpu.MINI58_33.build.variant=MINI58
MINI58.menu.cpu.MINI58_33.build.board=GENERIC_MINI58TZ
MINI58.menu.cpu.MINI58_33.build.series=Mini58Series
MINI58.menu.cpu.MINI58_33.build.ldscript=32K_4K_flash.ld
MINI58.menu.cpu.MINI58_33.upload.maximum_size=32768
MINI58.menu.cpu.MINI58_33.upload.maximum_data_size=4096
MINI58.menu.cpu.MINI58_33.upload.device=MINI58TAN

MINI58.menu.cpu.MINI58_20=GENERIC_MINI58F(TSSOP20)(32kFLASH 4kRAM)
MINI58.menu.cpu.MINI58_20.build.extra_flags=-DCHIP20P -DMINI58F
MINI58.menu.cpu.MINI58_20.build.variant=MINI58
MINI58.menu.cpu.MINI58_20.build.board=GENERIC_MINI58F
MINI58.menu.cpu.MINI58_20.build.series=Mini58Series
MINI58.menu.cpu.MINI58_20.build.ldscript=32K_4K_flash.ld
MINI58.menu.cpu.MINI58_20.upload.maximum_size=32768
MINI58.menu.cpu.MINI58_20.upload.maximum_data_size=4096
MINI58.menu.cpu.MINI58_20.upload.device=MINI58FAN

MINI58.menu.clock_source.HIRC=HIRC_22M(22.1184MHz)
MINI58.menu.clock_source.HIRC.build.f_cpu=22118400L -DHIRC
MINI58.menu.clock_source.HXT125=HXT_12M(50MMHz)
MINI58.menu.clock_source.HXT125.build.f_cpu=50000000L -DHXT12
#MINI58.menu.clock_source.HXT1210=HXT_12M(100MMHz)
#MINI58.menu.clock_source.HXT1210.build.f_cpu=100000000L -DHXT12

MINI58.menu.serial.UART0=Serial0(P1_2/3)
MINI58.menu.serial.UART0.build.extra_flags_serial=-DMENU_SERIAL=Serial0
MINI58.menu.serial.UART1=Serial1(P1_4/5)
MINI58.menu.serial.UART1.build.extra_flags_serial=-DMENU_SERIAL=Serial1
MINI58.menu.serial.NuICE=Nulink console
MINI58.menu.serial.NuICE.build.extra_flags_serial=-DMENU_SERIAL=NuConsole
MINI58.menu.serial.NuICE.upload.console=NUCONSOLE

