huaweiwx/ARDUINO_Nuvoton/hardware/arm/Nuvoton/boards.txt
#-------------------------------------- DEBUG & LOGLEVEL ---------------------------------------#
NUC029FAE.menu.log.default=Release(no-exceptions)
NUC029FAE.menu.log.default.build.log_level=-fno-exceptions
NUC029FAE.menu.log.Release=Release(exceptions)
NUC029FAE.menu.log.fatal=FATAL
NUC029FAE.menu.log.fatal.build.log_level=-D__LOG_LEVEL=1 -DUSE_ASSERT
NUC029FAE.menu.log.error=ERROR
NUC029FAE.menu.log.error.build.log_level=-D__LOG_LEVEL=2 -DUSE_ASSERT
NUC029FAE.menu.log.warning=WARNING
NUC029FAE.menu.log.warning.build.log_level=-D__LOG_LEVEL=3 -DUSE_ASSERT
NUC029FAE.menu.log.info=INFO
NUC029FAE.menu.log.info.build.log_level=-D__LOG_LEVEL=4 -DUSE_ASSERT
NUC029FAE.menu.log.debug=DEBUG
NUC029FAE.menu.log.debug.build.log_level=-D__LOG_LEVEL=5 -DUSE_ASSERT
NUC029FAE.menu.log.trace=TRACE
NUC029FAE.menu.log.trace.build.log_level=-D__LOG_LEVEL=6 -DUSE_ASSERT

NUC029FAE.menu.upload_method.nulink=Nulink
NUC029FAE.menu.upload_method.nulink.upload.tool=nulinkburn
NUC029FAE.menu.upload_method.nulink.upload.protocol=nuc-ba
NUC029FAE.menu.upload_method.nulink.upload.use_1200bps_touch=false
NUC029FAE.menu.upload_method.nulink.upload.wait_for_upload_port=false
NUC029FAE.menu.upload_method.nulink.upload.native_usb=false

NUC029FAE.menu.upload_method.jLinkMethod=JLink
NUC029FAE.menu.upload_method.jLinkMethod.upload.tool=jlinkob_upload
NUC029FAE.menu.upload_method.jLinkMethod.upload.protocol=jlink

############################################### The end ##########################################
